analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPCTRL_VCOREHVMON_DIS_POS         19 /**< LPCTRL_VCOREHVMON_DIS Position */
#define MXC_F_PWRSEQ_LPCTRL_VCOREHVMON_DIS             ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPCTRL_VCOREHVMON_DIS_POS)) /**< LPCTRL_VCOREHVMON_DIS Mask */

#define MXC_F_PWRSEQ_LPCTRL_VDDCMON_DIS_POS            20 /**< LPCTRL_VDDCMON_DIS Position */
#define MXC_F_PWRSEQ_LPCTRL_VDDCMON_DIS                ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPCTRL_VDDCMON_DIS_POS)) /**< LPCTRL_VDDCMON_DIS Mask */

#define MXC_F_PWRSEQ_LPCTRL_VRTCMON_DIS_POS            21 /**< LPCTRL_VRTCMON_DIS Position */
#define MXC_F_PWRSEQ_LPCTRL_VRTCMON_DIS                ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPCTRL_VRTCMON_DIS_POS)) /**< LPCTRL_VRTCMON_DIS Mask */

#define MXC_F_PWRSEQ_LPCTRL_VDDAMON_DIS_POS            22 /**< LPCTRL_VDDAMON_DIS Position */
#define MXC_F_PWRSEQ_LPCTRL_VDDAMON_DIS                ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPCTRL_VDDAMON_DIS_POS)) /**< LPCTRL_VDDAMON_DIS Mask */

#define MXC_F_PWRSEQ_LPCTRL_VDDIOMON_DIS_POS           23 /**< LPCTRL_VDDIOMON_DIS Position */
#define MXC_F_PWRSEQ_LPCTRL_VDDIOMON_DIS               ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPCTRL_VDDIOMON_DIS_POS)) /**< LPCTRL_VDDIOMON_DIS Mask */

#define MXC_F_PWRSEQ_LPCTRL_VDDIOHMON_DIS_POS          24 /**< LPCTRL_VDDIOHMON_DIS Position */
#define MXC_F_PWRSEQ_LPCTRL_VDDIOHMON_DIS              ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPCTRL_VDDIOHMON_DIS_POS)) /**< LPCTRL_VDDIOHMON_DIS Mask */

#define MXC_F_PWRSEQ_LPCTRL_VDDBMON_DIS_POS            27 /**< LPCTRL_VDDBMON_DIS Position */
#define MXC_F_PWRSEQ_LPCTRL_VDDBMON_DIS                ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPCTRL_VDDBMON_DIS_POS)) /**< LPCTRL_VDDBMON_DIS Mask */

/**@} end of group PWRSEQ_LPCTRL_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPWKFL0 PWRSEQ_LPWKFL0
 * @brief    Low Power I/O Wakeup Status Register 0. This register indicates the low power
 *           wakeup status for GPIO0.
 * @{
 */
#define MXC_F_PWRSEQ_LPWKFL0_ALL_POS                   0 /**< LPWKFL0_ALL Position */
#define MXC_F_PWRSEQ_LPWKFL0_ALL                       ((uint32_t)(0x7FFFFFFFUL << MXC_F_PWRSEQ_LPWKFL0_ALL_POS)) /**< LPWKFL0_ALL Mask */

/**@} end of group PWRSEQ_LPWKFL0_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPWKEN0 PWRSEQ_LPWKEN0
 * @brief    Low Power I/O Wakeup Enable Register 0. This register enables low power wakeup
 *           functionality for GPIO0.
 * @{
 */
#define MXC_F_PWRSEQ_LPWKEN0_ALL_POS                   0 /**< LPWKEN0_ALL Position */
#define MXC_F_PWRSEQ_LPWKEN0_ALL                       ((uint32_t)(0x7FFFFFFFUL << MXC_F_PWRSEQ_LPWKEN0_ALL_POS)) /**< LPWKEN0_ALL Mask */

/**@} end of group PWRSEQ_LPWKEN0_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPPWKFL PWRSEQ_LPPWKFL
 * @brief    Low Power Peripheral Wakeup Status Register.
 * @{
 */
#define MXC_F_PWRSEQ_LPPWKFL_USBLS_POS                 0 /**< LPPWKFL_USBLS Position */
#define MXC_F_PWRSEQ_LPPWKFL_USBLS                     ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPPWKFL_USBLS_POS)) /**< LPPWKFL_USBLS Mask */

#define MXC_F_PWRSEQ_LPPWKFL_AINCOMP0_POS              4 /**< LPPWKFL_AINCOMP0 Position */
#define MXC_F_PWRSEQ_LPPWKFL_AINCOMP0                  ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKFL_AINCOMP0_POS)) /**< LPPWKFL_AINCOMP0 Mask */

#define MXC_F_PWRSEQ_LPPWKFL_USBVBUS_POS               2 /**< LPPWKFL_USBVBUS Position */
#define MXC_F_PWRSEQ_LPPWKFL_USBVBUS                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKFL_USBVBUS_POS)) /**< LPPWKFL_USBVBUS Mask */

#define MXC_F_PWRSEQ_LPPWKFL_BACKUP_POS                16 /**< LPPWKFL_BACKUP Position */
#define MXC_F_PWRSEQ_LPPWKFL_BACKUP                    ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKFL_BACKUP_POS)) /**< LPPWKFL_BACKUP Mask */

#define MXC_F_PWRSEQ_LPPWKFL_RSTDET_POS                17 /**< LPPWKFL_RSTDET Position */
#define MXC_F_PWRSEQ_LPPWKFL_RSTDET                    ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKFL_RSTDET_POS)) /**< LPPWKFL_RSTDET Mask */

/**@} end of group PWRSEQ_LPPWKFL_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPPWKEN PWRSEQ_LPPWKEN
 * @brief    Low Power Peripheral Wakeup Enable Register.
 * @{
 */
#define MXC_F_PWRSEQ_LPPWKEN_USBLS_POS                 0 /**< LPPWKEN_USBLS Position */
#define MXC_F_PWRSEQ_LPPWKEN_USBLS                     ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPPWKEN_USBLS_POS)) /**< LPPWKEN_USBLS Mask */

#define MXC_F_PWRSEQ_LPPWKEN_USBVBUS_POS               2 /**< LPPWKEN_USBVBUS Position */
#define MXC_F_PWRSEQ_LPPWKEN_USBVBUS                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_USBVBUS_POS)) /**< LPPWKEN_USBVBUS Mask */

#define MXC_F_PWRSEQ_LPPWKEN_AINCOMP0_POS              4 /**< LPPWKEN_AINCOMP0 Position */
#define MXC_F_PWRSEQ_LPPWKEN_AINCOMP0                  ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_AINCOMP0_POS)) /**< LPPWKEN_AINCOMP0 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_WDT0_POS                  8 /**< LPPWKEN_WDT0 Position */
#define MXC_F_PWRSEQ_LPPWKEN_WDT0                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_WDT0_POS)) /**< LPPWKEN_WDT0 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_WDT1_POS                  9 /**< LPPWKEN_WDT1 Position */
#define MXC_F_PWRSEQ_LPPWKEN_WDT1                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_WDT1_POS)) /**< LPPWKEN_WDT1 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_CPU1_POS                  10 /**< LPPWKEN_CPU1 Position */
#define MXC_F_PWRSEQ_LPPWKEN_CPU1                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_CPU1_POS)) /**< LPPWKEN_CPU1 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_TMR0_POS                  11 /**< LPPWKEN_TMR0 Position */
#define MXC_F_PWRSEQ_LPPWKEN_TMR0                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_TMR0_POS)) /**< LPPWKEN_TMR0 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_TMR1_POS                  12 /**< LPPWKEN_TMR1 Position */
#define MXC_F_PWRSEQ_LPPWKEN_TMR1                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_TMR1_POS)) /**< LPPWKEN_TMR1 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_TMR2_POS                  13 /**< LPPWKEN_TMR2 Position */
#define MXC_F_PWRSEQ_LPPWKEN_TMR2                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_TMR2_POS)) /**< LPPWKEN_TMR2 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_TMR3_POS                  14 /**< LPPWKEN_TMR3 Position */
#define MXC_F_PWRSEQ_LPPWKEN_TMR3                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_TMR3_POS)) /**< LPPWKEN_TMR3 Mask */

