analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPPWKEN_TMR4_POS                  15 /**< LPPWKEN_TMR4 Position */
#define MXC_F_PWRSEQ_LPPWKEN_TMR4                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_TMR4_POS)) /**< LPPWKEN_TMR4 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_TMR5_POS                  16 /**< LPPWKEN_TMR5 Position */
#define MXC_F_PWRSEQ_LPPWKEN_TMR5                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_TMR5_POS)) /**< LPPWKEN_TMR5 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_UART0_POS                 17 /**< LPPWKEN_UART0 Position */
#define MXC_F_PWRSEQ_LPPWKEN_UART0                     ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_UART0_POS)) /**< LPPWKEN_UART0 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_UART1_POS                 18 /**< LPPWKEN_UART1 Position */
#define MXC_F_PWRSEQ_LPPWKEN_UART1                     ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_UART1_POS)) /**< LPPWKEN_UART1 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_UART2_POS                 19 /**< LPPWKEN_UART2 Position */
#define MXC_F_PWRSEQ_LPPWKEN_UART2                     ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_UART2_POS)) /**< LPPWKEN_UART2 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_UART3_POS                 20 /**< LPPWKEN_UART3 Position */
#define MXC_F_PWRSEQ_LPPWKEN_UART3                     ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_UART3_POS)) /**< LPPWKEN_UART3 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_I2C0_POS                  21 /**< LPPWKEN_I2C0 Position */
#define MXC_F_PWRSEQ_LPPWKEN_I2C0                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_I2C0_POS)) /**< LPPWKEN_I2C0 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_I2C1_POS                  22 /**< LPPWKEN_I2C1 Position */
#define MXC_F_PWRSEQ_LPPWKEN_I2C1                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_I2C1_POS)) /**< LPPWKEN_I2C1 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_I2C2_POS                  23 /**< LPPWKEN_I2C2 Position */
#define MXC_F_PWRSEQ_LPPWKEN_I2C2                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_I2C2_POS)) /**< LPPWKEN_I2C2 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_I2S_POS                   24 /**< LPPWKEN_I2S Position */
#define MXC_F_PWRSEQ_LPPWKEN_I2S                       ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_I2S_POS)) /**< LPPWKEN_I2S Mask */

#define MXC_F_PWRSEQ_LPPWKEN_SPI1_POS                  25 /**< LPPWKEN_SPI1 Position */
#define MXC_F_PWRSEQ_LPPWKEN_SPI1                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_SPI1_POS)) /**< LPPWKEN_SPI1 Mask */

#define MXC_F_PWRSEQ_LPPWKEN_LPCMP_POS                 26 /**< LPPWKEN_LPCMP Position */
#define MXC_F_PWRSEQ_LPPWKEN_LPCMP                     ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPPWKEN_LPCMP_POS)) /**< LPPWKEN_LPCMP Mask */

/**@} end of group PWRSEQ_LPPWKEN_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPMEMSD PWRSEQ_LPMEMSD
 * @brief    Low Power Memory Shutdown Control.
 * @{
 */
#define MXC_F_PWRSEQ_LPMEMSD_RAM0_POS                  0 /**< LPMEMSD_RAM0 Position */
#define MXC_F_PWRSEQ_LPMEMSD_RAM0                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_RAM0_POS)) /**< LPMEMSD_RAM0 Mask */

#define MXC_F_PWRSEQ_LPMEMSD_RAM1_POS                  1 /**< LPMEMSD_RAM1 Position */
#define MXC_F_PWRSEQ_LPMEMSD_RAM1                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_RAM1_POS)) /**< LPMEMSD_RAM1 Mask */

#define MXC_F_PWRSEQ_LPMEMSD_RAM2_POS                  2 /**< LPMEMSD_RAM2 Position */
#define MXC_F_PWRSEQ_LPMEMSD_RAM2                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_RAM2_POS)) /**< LPMEMSD_RAM2 Mask */

#define MXC_F_PWRSEQ_LPMEMSD_RAM3_POS                  3 /**< LPMEMSD_RAM3 Position */
#define MXC_F_PWRSEQ_LPMEMSD_RAM3                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_RAM3_POS)) /**< LPMEMSD_RAM3 Mask */

#define MXC_F_PWRSEQ_LPMEMSD_RAM4_POS                  4 /**< LPMEMSD_RAM4 Position */
#define MXC_F_PWRSEQ_LPMEMSD_RAM4                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_RAM4_POS)) /**< LPMEMSD_RAM4 Mask */

#define MXC_F_PWRSEQ_LPMEMSD_RAM5_POS                  5 /**< LPMEMSD_RAM5 Position */
#define MXC_F_PWRSEQ_LPMEMSD_RAM5                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_RAM5_POS)) /**< LPMEMSD_RAM5 Mask */

#define MXC_F_PWRSEQ_LPMEMSD_ICC_POS                   7 /**< LPMEMSD_ICC Position */
#define MXC_F_PWRSEQ_LPMEMSD_ICC                       ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_ICC_POS)) /**< LPMEMSD_ICC Mask */

#define MXC_F_PWRSEQ_LPMEMSD_ICCXIP_POS                8 /**< LPMEMSD_ICCXIP Position */
#define MXC_F_PWRSEQ_LPMEMSD_ICCXIP                    ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_ICCXIP_POS)) /**< LPMEMSD_ICCXIP Mask */

#define MXC_F_PWRSEQ_LPMEMSD_SRCC_POS                  9 /**< LPMEMSD_SRCC Position */
#define MXC_F_PWRSEQ_LPMEMSD_SRCC                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_SRCC_POS)) /**< LPMEMSD_SRCC Mask */

#define MXC_F_PWRSEQ_LPMEMSD_USBFIFO_POS               11 /**< LPMEMSD_USBFIFO Position */
#define MXC_F_PWRSEQ_LPMEMSD_USBFIFO                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_USBFIFO_POS)) /**< LPMEMSD_USBFIFO Mask */

#define MXC_F_PWRSEQ_LPMEMSD_ROM0_POS                  12 /**< LPMEMSD_ROM0 Position */
#define MXC_F_PWRSEQ_LPMEMSD_ROM0                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_ROM0_POS)) /**< LPMEMSD_ROM0 Mask */

#define MXC_F_PWRSEQ_LPMEMSD_MEU_POS                   13 /**< LPMEMSD_MEU Position */
#define MXC_F_PWRSEQ_LPMEMSD_MEU                       ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_MEU_POS)) /**< LPMEMSD_MEU Mask */

#define MXC_F_PWRSEQ_LPMEMSD_ROM1_POS                  15 /**< LPMEMSD_ROM1 Position */
#define MXC_F_PWRSEQ_LPMEMSD_ROM1                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_ROM1_POS)) /**< LPMEMSD_ROM1 Mask */

/**@} end of group PWRSEQ_LPMEMSD_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPVDDPD PWRSEQ_LPVDDPD
 * @brief    Low Power VDD Domain Power Down Control.
 * @{
 */
#define MXC_F_PWRSEQ_LPVDDPD_BTLE_POS                  1 /**< LPVDDPD_BTLE Position */
#define MXC_F_PWRSEQ_LPVDDPD_BTLE                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPVDDPD_BTLE_POS)) /**< LPVDDPD_BTLE Mask */

/**@} end of group PWRSEQ_LPVDDPD_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPWKPOL0A PWRSEQ_LPWKPOL0A
 * @brief    Low Power Wakeup Polarity Select for GPIO0.
 * @{
 */
#define MXC_F_PWRSEQ_LPWKPOL0A_0_POS                   0 /**< LPWKPOL0A_0 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_0                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_0_POS)) /**< LPWKPOL0A_0 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_0_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_0_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_0_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_0_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_0_POS) /**< LPWKPOL0A_0_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_0_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_0_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_0_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_0_RISING << MXC_F_PWRSEQ_LPWKPOL0A_0_POS) /**< LPWKPOL0A_0_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_0_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_0_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_0_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_0_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_0_POS) /**< LPWKPOL0A_0_FALLING Setting */

