analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPWKPOL0A_7_POS                   14 /**< LPWKPOL0A_7 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_7                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_7_POS)) /**< LPWKPOL0A_7 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_7_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_7_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_7_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_7_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_7_POS) /**< LPWKPOL0A_7_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_7_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_7_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_7_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_7_RISING << MXC_F_PWRSEQ_LPWKPOL0A_7_POS) /**< LPWKPOL0A_7_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_7_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_7_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_7_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_7_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_7_POS) /**< LPWKPOL0A_7_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_8_POS                   16 /**< LPWKPOL0A_8 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_8                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_8_POS)) /**< LPWKPOL0A_8 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_8_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_8_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_8_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_8_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_8_POS) /**< LPWKPOL0A_8_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_8_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_8_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_8_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_8_RISING << MXC_F_PWRSEQ_LPWKPOL0A_8_POS) /**< LPWKPOL0A_8_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_8_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_8_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_8_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_8_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_8_POS) /**< LPWKPOL0A_8_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_9_POS                   18 /**< LPWKPOL0A_9 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_9                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_9_POS)) /**< LPWKPOL0A_9 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_9_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_9_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_9_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_9_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_9_POS) /**< LPWKPOL0A_9_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_9_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_9_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_9_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_9_RISING << MXC_F_PWRSEQ_LPWKPOL0A_9_POS) /**< LPWKPOL0A_9_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_9_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_9_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_9_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_9_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_9_POS) /**< LPWKPOL0A_9_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_10_POS                  20 /**< LPWKPOL0A_10 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_10                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_10_POS)) /**< LPWKPOL0A_10 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_10_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL0A_10_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_10_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL0A_10_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_10_POS) /**< LPWKPOL0A_10_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_10_RISING               ((uint32_t)0x1UL) /**< LPWKPOL0A_10_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_10_RISING               (MXC_V_PWRSEQ_LPWKPOL0A_10_RISING << MXC_F_PWRSEQ_LPWKPOL0A_10_POS) /**< LPWKPOL0A_10_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_10_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL0A_10_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_10_FALLING              (MXC_V_PWRSEQ_LPWKPOL0A_10_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_10_POS) /**< LPWKPOL0A_10_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_11_POS                  22 /**< LPWKPOL0A_11 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_11                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_11_POS)) /**< LPWKPOL0A_11 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_11_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL0A_11_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_11_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL0A_11_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_11_POS) /**< LPWKPOL0A_11_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_11_RISING               ((uint32_t)0x1UL) /**< LPWKPOL0A_11_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_11_RISING               (MXC_V_PWRSEQ_LPWKPOL0A_11_RISING << MXC_F_PWRSEQ_LPWKPOL0A_11_POS) /**< LPWKPOL0A_11_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_11_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL0A_11_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_11_FALLING              (MXC_V_PWRSEQ_LPWKPOL0A_11_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_11_POS) /**< LPWKPOL0A_11_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_12_POS                  24 /**< LPWKPOL0A_12 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_12                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_12_POS)) /**< LPWKPOL0A_12 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_12_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL0A_12_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_12_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL0A_12_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_12_POS) /**< LPWKPOL0A_12_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_12_RISING               ((uint32_t)0x1UL) /**< LPWKPOL0A_12_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_12_RISING               (MXC_V_PWRSEQ_LPWKPOL0A_12_RISING << MXC_F_PWRSEQ_LPWKPOL0A_12_POS) /**< LPWKPOL0A_12_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_12_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL0A_12_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_12_FALLING              (MXC_V_PWRSEQ_LPWKPOL0A_12_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_12_POS) /**< LPWKPOL0A_12_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_13_POS                  26 /**< LPWKPOL0A_13 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_13                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_13_POS)) /**< LPWKPOL0A_13 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_13_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL0A_13_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_13_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL0A_13_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_13_POS) /**< LPWKPOL0A_13_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_13_RISING               ((uint32_t)0x1UL) /**< LPWKPOL0A_13_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_13_RISING               (MXC_V_PWRSEQ_LPWKPOL0A_13_RISING << MXC_F_PWRSEQ_LPWKPOL0A_13_POS) /**< LPWKPOL0A_13_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_13_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL0A_13_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_13_FALLING              (MXC_V_PWRSEQ_LPWKPOL0A_13_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_13_POS) /**< LPWKPOL0A_13_FALLING Setting */

