analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/pwrseq_regs.h
/**@} end of group PWRSEQ_LPWKPOL0B_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPWKPOL1A PWRSEQ_LPWKPOL1A
 * @brief    Low Power Wakeup Polarity Select for GPIO1.
 * @{
 */
#define MXC_F_PWRSEQ_LPWKPOL1A_0_POS                   0 /**< LPWKPOL1A_0 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_0                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_0_POS)) /**< LPWKPOL1A_0 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_0_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_0_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_0_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_0_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_0_POS) /**< LPWKPOL1A_0_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_0_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_0_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_0_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_0_RISING << MXC_F_PWRSEQ_LPWKPOL1A_0_POS) /**< LPWKPOL1A_0_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_0_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_0_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_0_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_0_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_0_POS) /**< LPWKPOL1A_0_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_1_POS                   2 /**< LPWKPOL1A_1 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_1                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_1_POS)) /**< LPWKPOL1A_1 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_1_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_1_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_1_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_1_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_1_POS) /**< LPWKPOL1A_1_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_1_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_1_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_1_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_1_RISING << MXC_F_PWRSEQ_LPWKPOL1A_1_POS) /**< LPWKPOL1A_1_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_1_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_1_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_1_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_1_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_1_POS) /**< LPWKPOL1A_1_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_2_POS                   4 /**< LPWKPOL1A_2 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_2                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_2_POS)) /**< LPWKPOL1A_2 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_2_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_2_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_2_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_2_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_2_POS) /**< LPWKPOL1A_2_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_2_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_2_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_2_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_2_RISING << MXC_F_PWRSEQ_LPWKPOL1A_2_POS) /**< LPWKPOL1A_2_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_2_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_2_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_2_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_2_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_2_POS) /**< LPWKPOL1A_2_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_3_POS                   6 /**< LPWKPOL1A_3 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_3                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_3_POS)) /**< LPWKPOL1A_3 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_3_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_3_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_3_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_3_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_3_POS) /**< LPWKPOL1A_3_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_3_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_3_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_3_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_3_RISING << MXC_F_PWRSEQ_LPWKPOL1A_3_POS) /**< LPWKPOL1A_3_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_3_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_3_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_3_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_3_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_3_POS) /**< LPWKPOL1A_3_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_4_POS                   8 /**< LPWKPOL1A_4 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_4                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_4_POS)) /**< LPWKPOL1A_4 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_4_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_4_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_4_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_4_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_4_POS) /**< LPWKPOL1A_4_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_4_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_4_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_4_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_4_RISING << MXC_F_PWRSEQ_LPWKPOL1A_4_POS) /**< LPWKPOL1A_4_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_4_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_4_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_4_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_4_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_4_POS) /**< LPWKPOL1A_4_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_5_POS                   10 /**< LPWKPOL1A_5 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_5                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_5_POS)) /**< LPWKPOL1A_5 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_5_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_5_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_5_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_5_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_5_POS) /**< LPWKPOL1A_5_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_5_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_5_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_5_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_5_RISING << MXC_F_PWRSEQ_LPWKPOL1A_5_POS) /**< LPWKPOL1A_5_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_5_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_5_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_5_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_5_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_5_POS) /**< LPWKPOL1A_5_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_6_POS                   12 /**< LPWKPOL1A_6 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_6                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_6_POS)) /**< LPWKPOL1A_6 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_6_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_6_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_6_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_6_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_6_POS) /**< LPWKPOL1A_6_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_6_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_6_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_6_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_6_RISING << MXC_F_PWRSEQ_LPWKPOL1A_6_POS) /**< LPWKPOL1A_6_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_6_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_6_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_6_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_6_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_6_POS) /**< LPWKPOL1A_6_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_7_POS                   14 /**< LPWKPOL1A_7 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_7                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_7_POS)) /**< LPWKPOL1A_7 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_7_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_7_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_7_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_7_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_7_POS) /**< LPWKPOL1A_7_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_7_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_7_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_7_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_7_RISING << MXC_F_PWRSEQ_LPWKPOL1A_7_POS) /**< LPWKPOL1A_7_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_7_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_7_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_7_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_7_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_7_POS) /**< LPWKPOL1A_7_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_8_POS                   16 /**< LPWKPOL1A_8 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_8                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_8_POS)) /**< LPWKPOL1A_8 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_8_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_8_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_8_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_8_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_8_POS) /**< LPWKPOL1A_8_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_8_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_8_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_8_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_8_RISING << MXC_F_PWRSEQ_LPWKPOL1A_8_POS) /**< LPWKPOL1A_8_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_8_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_8_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_8_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_8_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_8_POS) /**< LPWKPOL1A_8_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_9_POS                   18 /**< LPWKPOL1A_9 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_9                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_9_POS)) /**< LPWKPOL1A_9 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_9_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL1A_9_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_9_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL1A_9_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_9_POS) /**< LPWKPOL1A_9_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_9_RISING                ((uint32_t)0x1UL) /**< LPWKPOL1A_9_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_9_RISING                (MXC_V_PWRSEQ_LPWKPOL1A_9_RISING << MXC_F_PWRSEQ_LPWKPOL1A_9_POS) /**< LPWKPOL1A_9_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_9_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL1A_9_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_9_FALLING               (MXC_V_PWRSEQ_LPWKPOL1A_9_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_9_POS) /**< LPWKPOL1A_9_FALLING Setting */

