analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/pwrseq_regs.h
/**@} end of group PWRSEQ_LPWKPOL1A_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPWKPOL1B PWRSEQ_LPWKPOL1B
 * @brief    Low Power Wakeup Polarity Select for GPIO1.
 * @{
 */
#define MXC_F_PWRSEQ_LPWKPOL1B_16_POS                  0 /**< LPWKPOL1B_16 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_16                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_16_POS)) /**< LPWKPOL1B_16 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_16_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_16_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_16_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_16_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_16_POS) /**< LPWKPOL1B_16_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_16_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_16_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_16_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_16_RISING << MXC_F_PWRSEQ_LPWKPOL1B_16_POS) /**< LPWKPOL1B_16_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_16_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_16_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_16_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_16_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_16_POS) /**< LPWKPOL1B_16_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_17_POS                  2 /**< LPWKPOL1B_17 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_17                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_17_POS)) /**< LPWKPOL1B_17 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_17_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_17_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_17_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_17_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_17_POS) /**< LPWKPOL1B_17_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_17_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_17_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_17_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_17_RISING << MXC_F_PWRSEQ_LPWKPOL1B_17_POS) /**< LPWKPOL1B_17_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_17_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_17_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_17_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_17_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_17_POS) /**< LPWKPOL1B_17_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_18_POS                  4 /**< LPWKPOL1B_18 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_18                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_18_POS)) /**< LPWKPOL1B_18 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_18_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_18_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_18_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_18_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_18_POS) /**< LPWKPOL1B_18_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_18_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_18_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_18_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_18_RISING << MXC_F_PWRSEQ_LPWKPOL1B_18_POS) /**< LPWKPOL1B_18_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_18_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_18_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_18_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_18_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_18_POS) /**< LPWKPOL1B_18_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_19_POS                  6 /**< LPWKPOL1B_19 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_19                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_19_POS)) /**< LPWKPOL1B_19 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_19_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_19_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_19_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_19_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_19_POS) /**< LPWKPOL1B_19_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_19_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_19_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_19_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_19_RISING << MXC_F_PWRSEQ_LPWKPOL1B_19_POS) /**< LPWKPOL1B_19_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_19_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_19_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_19_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_19_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_19_POS) /**< LPWKPOL1B_19_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_20_POS                  8 /**< LPWKPOL1B_20 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_20                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_20_POS)) /**< LPWKPOL1B_20 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_20_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_20_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_20_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_20_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_20_POS) /**< LPWKPOL1B_20_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_20_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_20_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_20_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_20_RISING << MXC_F_PWRSEQ_LPWKPOL1B_20_POS) /**< LPWKPOL1B_20_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_20_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_20_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_20_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_20_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_20_POS) /**< LPWKPOL1B_20_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_21_POS                  10 /**< LPWKPOL1B_21 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_21                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_21_POS)) /**< LPWKPOL1B_21 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_21_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_21_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_21_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_21_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_21_POS) /**< LPWKPOL1B_21_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_21_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_21_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_21_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_21_RISING << MXC_F_PWRSEQ_LPWKPOL1B_21_POS) /**< LPWKPOL1B_21_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_21_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_21_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_21_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_21_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_21_POS) /**< LPWKPOL1B_21_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_22_POS                  12 /**< LPWKPOL1B_22 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_22                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_22_POS)) /**< LPWKPOL1B_22 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_22_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_22_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_22_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_22_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_22_POS) /**< LPWKPOL1B_22_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_22_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_22_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_22_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_22_RISING << MXC_F_PWRSEQ_LPWKPOL1B_22_POS) /**< LPWKPOL1B_22_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_22_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_22_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_22_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_22_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_22_POS) /**< LPWKPOL1B_22_FALLING Setting */

