analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPWKPOL2A_6_POS                   12 /**< LPWKPOL2A_6 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_6                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_6_POS)) /**< LPWKPOL2A_6 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_6_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_6_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_6_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_6_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_6_POS) /**< LPWKPOL2A_6_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_6_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_6_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_6_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_6_RISING << MXC_F_PWRSEQ_LPWKPOL2A_6_POS) /**< LPWKPOL2A_6_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_6_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_6_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_6_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_6_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_6_POS) /**< LPWKPOL2A_6_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_7_POS                   14 /**< LPWKPOL2A_7 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_7                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_7_POS)) /**< LPWKPOL2A_7 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_7_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_7_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_7_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_7_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_7_POS) /**< LPWKPOL2A_7_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_7_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_7_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_7_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_7_RISING << MXC_F_PWRSEQ_LPWKPOL2A_7_POS) /**< LPWKPOL2A_7_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_7_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_7_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_7_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_7_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_7_POS) /**< LPWKPOL2A_7_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_8_POS                   16 /**< LPWKPOL2A_8 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_8                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_8_POS)) /**< LPWKPOL2A_8 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_8_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_8_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_8_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_8_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_8_POS) /**< LPWKPOL2A_8_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_8_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_8_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_8_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_8_RISING << MXC_F_PWRSEQ_LPWKPOL2A_8_POS) /**< LPWKPOL2A_8_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_8_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_8_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_8_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_8_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_8_POS) /**< LPWKPOL2A_8_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_9_POS                   18 /**< LPWKPOL2A_9 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_9                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_9_POS)) /**< LPWKPOL2A_9 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_9_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_9_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_9_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_9_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_9_POS) /**< LPWKPOL2A_9_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_9_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_9_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_9_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_9_RISING << MXC_F_PWRSEQ_LPWKPOL2A_9_POS) /**< LPWKPOL2A_9_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_9_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_9_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_9_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_9_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_9_POS) /**< LPWKPOL2A_9_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_10_POS                  20 /**< LPWKPOL2A_10 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_10                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_10_POS)) /**< LPWKPOL2A_10 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_10_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2A_10_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_10_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2A_10_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_10_POS) /**< LPWKPOL2A_10_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_10_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2A_10_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_10_RISING               (MXC_V_PWRSEQ_LPWKPOL2A_10_RISING << MXC_F_PWRSEQ_LPWKPOL2A_10_POS) /**< LPWKPOL2A_10_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_10_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2A_10_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_10_FALLING              (MXC_V_PWRSEQ_LPWKPOL2A_10_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_10_POS) /**< LPWKPOL2A_10_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_11_POS                  22 /**< LPWKPOL2A_11 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_11                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_11_POS)) /**< LPWKPOL2A_11 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_11_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2A_11_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_11_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2A_11_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_11_POS) /**< LPWKPOL2A_11_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_11_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2A_11_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_11_RISING               (MXC_V_PWRSEQ_LPWKPOL2A_11_RISING << MXC_F_PWRSEQ_LPWKPOL2A_11_POS) /**< LPWKPOL2A_11_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_11_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2A_11_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_11_FALLING              (MXC_V_PWRSEQ_LPWKPOL2A_11_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_11_POS) /**< LPWKPOL2A_11_FALLING Setting */

