analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPWKPOL2A_12_POS                  24 /**< LPWKPOL2A_12 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_12                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_12_POS)) /**< LPWKPOL2A_12 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_12_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2A_12_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_12_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2A_12_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_12_POS) /**< LPWKPOL2A_12_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_12_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2A_12_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_12_RISING               (MXC_V_PWRSEQ_LPWKPOL2A_12_RISING << MXC_F_PWRSEQ_LPWKPOL2A_12_POS) /**< LPWKPOL2A_12_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_12_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2A_12_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_12_FALLING              (MXC_V_PWRSEQ_LPWKPOL2A_12_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_12_POS) /**< LPWKPOL2A_12_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_13_POS                  26 /**< LPWKPOL2A_13 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_13                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_13_POS)) /**< LPWKPOL2A_13 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_13_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2A_13_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_13_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2A_13_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_13_POS) /**< LPWKPOL2A_13_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_13_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2A_13_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_13_RISING               (MXC_V_PWRSEQ_LPWKPOL2A_13_RISING << MXC_F_PWRSEQ_LPWKPOL2A_13_POS) /**< LPWKPOL2A_13_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_13_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2A_13_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_13_FALLING              (MXC_V_PWRSEQ_LPWKPOL2A_13_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_13_POS) /**< LPWKPOL2A_13_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_14_POS                  28 /**< LPWKPOL2A_14 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_14                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_14_POS)) /**< LPWKPOL2A_14 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_14_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2A_14_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_14_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2A_14_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_14_POS) /**< LPWKPOL2A_14_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_14_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2A_14_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_14_RISING               (MXC_V_PWRSEQ_LPWKPOL2A_14_RISING << MXC_F_PWRSEQ_LPWKPOL2A_14_POS) /**< LPWKPOL2A_14_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_14_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2A_14_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_14_FALLING              (MXC_V_PWRSEQ_LPWKPOL2A_14_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_14_POS) /**< LPWKPOL2A_14_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_15_POS                  30 /**< LPWKPOL2A_15 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_15                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_15_POS)) /**< LPWKPOL2A_15 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_15_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2A_15_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_15_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2A_15_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_15_POS) /**< LPWKPOL2A_15_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_15_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2A_15_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_15_RISING               (MXC_V_PWRSEQ_LPWKPOL2A_15_RISING << MXC_F_PWRSEQ_LPWKPOL2A_15_POS) /**< LPWKPOL2A_15_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_15_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2A_15_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_15_FALLING              (MXC_V_PWRSEQ_LPWKPOL2A_15_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_15_POS) /**< LPWKPOL2A_15_FALLING Setting */

/**@} end of group PWRSEQ_LPWKPOL2A_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPWKPOL2B PWRSEQ_LPWKPOL2B
 * @brief    Low Power Wakeup Polarity Select for GPIO2.
 * @{
 */
#define MXC_F_PWRSEQ_LPWKPOL2B_16_POS                  0 /**< LPWKPOL2B_16 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_16                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_16_POS)) /**< LPWKPOL2B_16 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_16_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_16_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_16_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_16_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_16_POS) /**< LPWKPOL2B_16_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_16_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_16_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_16_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_16_RISING << MXC_F_PWRSEQ_LPWKPOL2B_16_POS) /**< LPWKPOL2B_16_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_16_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_16_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_16_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_16_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_16_POS) /**< LPWKPOL2B_16_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_17_POS                  2 /**< LPWKPOL2B_17 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_17                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_17_POS)) /**< LPWKPOL2B_17 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_17_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_17_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_17_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_17_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_17_POS) /**< LPWKPOL2B_17_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_17_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_17_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_17_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_17_RISING << MXC_F_PWRSEQ_LPWKPOL2B_17_POS) /**< LPWKPOL2B_17_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_17_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_17_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_17_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_17_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_17_POS) /**< LPWKPOL2B_17_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_18_POS                  4 /**< LPWKPOL2B_18 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_18                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_18_POS)) /**< LPWKPOL2B_18 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_18_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_18_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_18_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_18_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_18_POS) /**< LPWKPOL2B_18_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_18_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_18_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_18_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_18_RISING << MXC_F_PWRSEQ_LPWKPOL2B_18_POS) /**< LPWKPOL2B_18_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_18_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_18_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_18_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_18_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_18_POS) /**< LPWKPOL2B_18_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_19_POS                  6 /**< LPWKPOL2B_19 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_19                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_19_POS)) /**< LPWKPOL2B_19 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_19_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_19_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_19_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_19_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_19_POS) /**< LPWKPOL2B_19_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_19_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_19_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_19_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_19_RISING << MXC_F_PWRSEQ_LPWKPOL2B_19_POS) /**< LPWKPOL2B_19_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_19_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_19_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_19_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_19_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_19_POS) /**< LPWKPOL2B_19_FALLING Setting */

