analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPWKPOL2B_27_POS                  22 /**< LPWKPOL2B_27 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_27                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_27_POS)) /**< LPWKPOL2B_27 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_27_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_27_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_27_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_27_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_27_POS) /**< LPWKPOL2B_27_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_27_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_27_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_27_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_27_RISING << MXC_F_PWRSEQ_LPWKPOL2B_27_POS) /**< LPWKPOL2B_27_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_27_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_27_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_27_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_27_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_27_POS) /**< LPWKPOL2B_27_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_28_POS                  24 /**< LPWKPOL2B_28 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_28                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_28_POS)) /**< LPWKPOL2B_28 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_28_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_28_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_28_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_28_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_28_POS) /**< LPWKPOL2B_28_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_28_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_28_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_28_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_28_RISING << MXC_F_PWRSEQ_LPWKPOL2B_28_POS) /**< LPWKPOL2B_28_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_28_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_28_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_28_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_28_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_28_POS) /**< LPWKPOL2B_28_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_29_POS                  26 /**< LPWKPOL2B_29 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_29                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_29_POS)) /**< LPWKPOL2B_29 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_29_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_29_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_29_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_29_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_29_POS) /**< LPWKPOL2B_29_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_29_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_29_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_29_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_29_RISING << MXC_F_PWRSEQ_LPWKPOL2B_29_POS) /**< LPWKPOL2B_29_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_29_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_29_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_29_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_29_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_29_POS) /**< LPWKPOL2B_29_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_30_POS                  28 /**< LPWKPOL2B_30 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_30                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_30_POS)) /**< LPWKPOL2B_30 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_30_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_30_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_30_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_30_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_30_POS) /**< LPWKPOL2B_30_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_30_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_30_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_30_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_30_RISING << MXC_F_PWRSEQ_LPWKPOL2B_30_POS) /**< LPWKPOL2B_30_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_30_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_30_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_30_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_30_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_30_POS) /**< LPWKPOL2B_30_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_31_POS                  30 /**< LPWKPOL2B_31 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_31                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_31_POS)) /**< LPWKPOL2B_31 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_31_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_31_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_31_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_31_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_31_POS) /**< LPWKPOL2B_31_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_31_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_31_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_31_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_31_RISING << MXC_F_PWRSEQ_LPWKPOL2B_31_POS) /**< LPWKPOL2B_31_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_31_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_31_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_31_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_31_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_31_POS) /**< LPWKPOL2B_31_FALLING Setting */

/**@} end of group PWRSEQ_LPWKPOL2B_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPWKPOL3 PWRSEQ_LPWKPOL3
 * @brief    Low Power Wakeup Polarity Select for GPIO3.
 * @{
 */
#define MXC_F_PWRSEQ_LPWKPOL3_0_POS                    0 /**< LPWKPOL3_0 Position */
#define MXC_F_PWRSEQ_LPWKPOL3_0                        ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL3_0_POS)) /**< LPWKPOL3_0 Mask */
#define MXC_V_PWRSEQ_LPWKPOL3_0_BOTH_EDGES             ((uint32_t)0x0UL) /**< LPWKPOL3_0_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL3_0_BOTH_EDGES             (MXC_V_PWRSEQ_LPWKPOL3_0_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL3_0_POS) /**< LPWKPOL3_0_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_0_RISING                 ((uint32_t)0x1UL) /**< LPWKPOL3_0_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_0_RISING                 (MXC_V_PWRSEQ_LPWKPOL3_0_RISING << MXC_F_PWRSEQ_LPWKPOL3_0_POS) /**< LPWKPOL3_0_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_0_FALLING                ((uint32_t)0x2UL) /**< LPWKPOL3_0_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_0_FALLING                (MXC_V_PWRSEQ_LPWKPOL3_0_FALLING << MXC_F_PWRSEQ_LPWKPOL3_0_POS) /**< LPWKPOL3_0_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL3_1_POS                    2 /**< LPWKPOL3_1 Position */
#define MXC_F_PWRSEQ_LPWKPOL3_1                        ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL3_1_POS)) /**< LPWKPOL3_1 Mask */
#define MXC_V_PWRSEQ_LPWKPOL3_1_BOTH_EDGES             ((uint32_t)0x0UL) /**< LPWKPOL3_1_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL3_1_BOTH_EDGES             (MXC_V_PWRSEQ_LPWKPOL3_1_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL3_1_POS) /**< LPWKPOL3_1_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_1_RISING                 ((uint32_t)0x1UL) /**< LPWKPOL3_1_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_1_RISING                 (MXC_V_PWRSEQ_LPWKPOL3_1_RISING << MXC_F_PWRSEQ_LPWKPOL3_1_POS) /**< LPWKPOL3_1_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_1_FALLING                ((uint32_t)0x2UL) /**< LPWKPOL3_1_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_1_FALLING                (MXC_V_PWRSEQ_LPWKPOL3_1_FALLING << MXC_F_PWRSEQ_LPWKPOL3_1_POS) /**< LPWKPOL3_1_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL3_2_POS                    4 /**< LPWKPOL3_2 Position */
#define MXC_F_PWRSEQ_LPWKPOL3_2                        ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL3_2_POS)) /**< LPWKPOL3_2 Mask */
#define MXC_V_PWRSEQ_LPWKPOL3_2_BOTH_EDGES             ((uint32_t)0x0UL) /**< LPWKPOL3_2_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL3_2_BOTH_EDGES             (MXC_V_PWRSEQ_LPWKPOL3_2_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL3_2_POS) /**< LPWKPOL3_2_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_2_RISING                 ((uint32_t)0x1UL) /**< LPWKPOL3_2_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_2_RISING                 (MXC_V_PWRSEQ_LPWKPOL3_2_RISING << MXC_F_PWRSEQ_LPWKPOL3_2_POS) /**< LPWKPOL3_2_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_2_FALLING                ((uint32_t)0x2UL) /**< LPWKPOL3_2_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_2_FALLING                (MXC_V_PWRSEQ_LPWKPOL3_2_FALLING << MXC_F_PWRSEQ_LPWKPOL3_2_POS) /**< LPWKPOL3_2_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL3_3_POS                    6 /**< LPWKPOL3_3 Position */
#define MXC_F_PWRSEQ_LPWKPOL3_3                        ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL3_3_POS)) /**< LPWKPOL3_3 Mask */
#define MXC_V_PWRSEQ_LPWKPOL3_3_BOTH_EDGES             ((uint32_t)0x0UL) /**< LPWKPOL3_3_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL3_3_BOTH_EDGES             (MXC_V_PWRSEQ_LPWKPOL3_3_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL3_3_POS) /**< LPWKPOL3_3_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_3_RISING                 ((uint32_t)0x1UL) /**< LPWKPOL3_3_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_3_RISING                 (MXC_V_PWRSEQ_LPWKPOL3_3_RISING << MXC_F_PWRSEQ_LPWKPOL3_3_POS) /**< LPWKPOL3_3_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_3_FALLING                ((uint32_t)0x2UL) /**< LPWKPOL3_3_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_3_FALLING                (MXC_V_PWRSEQ_LPWKPOL3_3_FALLING << MXC_F_PWRSEQ_LPWKPOL3_3_POS) /**< LPWKPOL3_3_FALLING Setting */

