analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPWKPOL3_4_POS                    8 /**< LPWKPOL3_4 Position */
#define MXC_F_PWRSEQ_LPWKPOL3_4                        ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL3_4_POS)) /**< LPWKPOL3_4 Mask */
#define MXC_V_PWRSEQ_LPWKPOL3_4_BOTH_EDGES             ((uint32_t)0x0UL) /**< LPWKPOL3_4_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL3_4_BOTH_EDGES             (MXC_V_PWRSEQ_LPWKPOL3_4_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL3_4_POS) /**< LPWKPOL3_4_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_4_RISING                 ((uint32_t)0x1UL) /**< LPWKPOL3_4_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_4_RISING                 (MXC_V_PWRSEQ_LPWKPOL3_4_RISING << MXC_F_PWRSEQ_LPWKPOL3_4_POS) /**< LPWKPOL3_4_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_4_FALLING                ((uint32_t)0x2UL) /**< LPWKPOL3_4_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_4_FALLING                (MXC_V_PWRSEQ_LPWKPOL3_4_FALLING << MXC_F_PWRSEQ_LPWKPOL3_4_POS) /**< LPWKPOL3_4_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL3_5_POS                    10 /**< LPWKPOL3_5 Position */
#define MXC_F_PWRSEQ_LPWKPOL3_5                        ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL3_5_POS)) /**< LPWKPOL3_5 Mask */
#define MXC_V_PWRSEQ_LPWKPOL3_5_BOTH_EDGES             ((uint32_t)0x0UL) /**< LPWKPOL3_5_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL3_5_BOTH_EDGES             (MXC_V_PWRSEQ_LPWKPOL3_5_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL3_5_POS) /**< LPWKPOL3_5_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_5_RISING                 ((uint32_t)0x1UL) /**< LPWKPOL3_5_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_5_RISING                 (MXC_V_PWRSEQ_LPWKPOL3_5_RISING << MXC_F_PWRSEQ_LPWKPOL3_5_POS) /**< LPWKPOL3_5_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_5_FALLING                ((uint32_t)0x2UL) /**< LPWKPOL3_5_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_5_FALLING                (MXC_V_PWRSEQ_LPWKPOL3_5_FALLING << MXC_F_PWRSEQ_LPWKPOL3_5_POS) /**< LPWKPOL3_5_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL3_6_POS                    12 /**< LPWKPOL3_6 Position */
#define MXC_F_PWRSEQ_LPWKPOL3_6                        ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL3_6_POS)) /**< LPWKPOL3_6 Mask */
#define MXC_V_PWRSEQ_LPWKPOL3_6_BOTH_EDGES             ((uint32_t)0x0UL) /**< LPWKPOL3_6_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL3_6_BOTH_EDGES             (MXC_V_PWRSEQ_LPWKPOL3_6_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL3_6_POS) /**< LPWKPOL3_6_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_6_RISING                 ((uint32_t)0x1UL) /**< LPWKPOL3_6_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_6_RISING                 (MXC_V_PWRSEQ_LPWKPOL3_6_RISING << MXC_F_PWRSEQ_LPWKPOL3_6_POS) /**< LPWKPOL3_6_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_6_FALLING                ((uint32_t)0x2UL) /**< LPWKPOL3_6_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_6_FALLING                (MXC_V_PWRSEQ_LPWKPOL3_6_FALLING << MXC_F_PWRSEQ_LPWKPOL3_6_POS) /**< LPWKPOL3_6_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL3_7_POS                    14 /**< LPWKPOL3_7 Position */
#define MXC_F_PWRSEQ_LPWKPOL3_7                        ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL3_7_POS)) /**< LPWKPOL3_7 Mask */
#define MXC_V_PWRSEQ_LPWKPOL3_7_BOTH_EDGES             ((uint32_t)0x0UL) /**< LPWKPOL3_7_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL3_7_BOTH_EDGES             (MXC_V_PWRSEQ_LPWKPOL3_7_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL3_7_POS) /**< LPWKPOL3_7_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_7_RISING                 ((uint32_t)0x1UL) /**< LPWKPOL3_7_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_7_RISING                 (MXC_V_PWRSEQ_LPWKPOL3_7_RISING << MXC_F_PWRSEQ_LPWKPOL3_7_POS) /**< LPWKPOL3_7_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL3_7_FALLING                ((uint32_t)0x2UL) /**< LPWKPOL3_7_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL3_7_FALLING                (MXC_V_PWRSEQ_LPWKPOL3_7_FALLING << MXC_F_PWRSEQ_LPWKPOL3_7_POS) /**< LPWKPOL3_7_FALLING Setting */

/**@} end of group PWRSEQ_LPWKPOL3_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_PWRSEQ_REGS_H_
